# Automatically exclude development dependencies from Time Machine backups
brew "asimov", restart_service: :changed

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# Command-line fuzzy finder written in Go
brew "fzf"

# GitHub command-line tool
brew "gh"

# Git extension for versioning large files
brew "git-lfs"

# Ping, but with a graph
brew "gping"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]

# Development kit for the Java programming language
brew "openjdk"

# Rust toolchain installer
brew "rustup"

# Cross-shell prompt for astronauts
brew "starship"

# Modern and pretty fancy file manager for the terminal
brew "superfile"

# tldr 
brew "tealdeer"

# Display directories as trees (with optional color/HTML output)
brew "tree"

# Chromium based browser
cask "arc"

# 3D model slicing software for 3D printers, maintained by Bambu Lab
cask "bambu-studio"

# Online gaming platform
cask "battle-net"

# Display management tool
cask "betterdisplay"

# OpenAI's official ChatGPT desktop app
cask "chatgpt"

# Anthropic's official Claude AI desktop app
cask "claude"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Voice and text chat software
cask "discord"

# Collaborative team software
cask "figma"

# Web browser
cask "google-chrome"

# GPU-based terminal emulator
cask "kitty"

# Knowledge base that works on top of a local folder of plain text Markdown files
cask "notion"

# Like neofetch, but much faster because written mostly in C
brew "fastfetch"

# Music streaming service
cask "spotify"

# Calculator and converter application
cask "numi"

# Client for Proton Mail and Proton Calendar
cask "proton-mail"

# Control your tools with a few keystrokes
cask "raycast"

# Window snapping tool
cask "rectangle-pro"

# Collection of apps available by subscription
cask "setapp"

# 3D CAD software
cask "shapr3d"

# Team communication and collaboration software
cask "slack"

# Mesh VPN based on WireGuard
cask "tailscale"

# Messaging app with a focus on speed and security
cask "telegram"

# Native desktop client for WhatsApp
cask "whatsapp"

# since Brewfile's are just Ruby, we can include other Brewfiles
Dir.glob(File.expand_path("~/dotfiles/**/Brewfile")).each do |file|
  next if file == __FILE__ # avoid infinite loop if this file is inside dotfiles
  instance_eval File.read(file), file
end