tap "homebrew/cask"

brew "git"
brew "ripgrep"
brew "bash-completion"
brew "watchman"
brew "tree"
brew "bat"
brew "yarn", args: ["--without-node"]
brew "rclone"
brew "fzf"
brew "fish"
brew "starship"
brew "neovim"
brew "mas"

## CASKS
cask "alfred"
cask "alacritty"
cask "bettertouchtool"
cask "bartender"
cask "itsycal"
cask "visual-studio-code"
cask "1password"
cask "dash"
cask "iina"
cask "discord"
cask "avibrazil-rdm"
cask "spotify"
cask "sip"
cask "front"
cask "slack"
cask "sketch"
cask "spectacle"
cask "the-unarchiver"
cask "hyper"
cask "flux"
cask "notion"
cask "postman"
cask "daisydisk"

# Quicklook
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "webpquicklook"
cask "qlvideo"


# Browsers
cask "google-chrome"
cask "firefox"
cask "brave-browser"

## Mac App Store
# As mas signin is broken for macOS 10.13+ you need to sign in manually first
# mas "Spark",  id: 1176895641
# mas "Amphetamine", id: 937984704
# mas "Numbers", id: 409203825 
